#include <stdio.h>
#include <locale.h>
void main(void)
{
	setlocale(LC_ALL, "RUS");
	printf("%20s \n", "Этот текст");
	printf("%s\n\t", "Этот текст");
	printf("%s \n", "Этот текст");
	printf("%10.5f\n", 12.234657);
	printf("Осаток от деления % d на %d равен %d\n", 5, 2, 5 % 2);
	printf("Деление %f на %d равен %f \n", 7., 5, 7. / 5);
	printf("Умножение %d на %d равен %d\n", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n", 5., 2., 5. / 2);
	printf("%d разделить %d равно %f\n", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n", 5., 2., 5. / 2);
	printf("%e разделить %e равно %f\n", 5., 2., 5. / 2);
	puts("-------------------");
	int N = 10, K = 10;
	printf("сейчас %d часов %d минут 00 секунд\n",N, K);
	printf("идет %d минута суток\n",N*60 + K);
	printf("до полуночи осталось %d часов и %d минут \n",24*60 - N*60, 60 - K);
	printf("c 8:00 прошло %d секунд \n", N - 8);
	printf("текущий час = %d суток и текущая минута = %d часа\n", N, K);
	puts("-------------------");


	


}
	